In [1]:
import pandas as pd
import numpy as np
import matplotlib.dates as mdates

In [2]:
Ningbo = 300000
b1 = 15700
b2 = 9733
b3 = 9265
Baodan = b1+b2+b3
Cash = 50000
Rate1 = 6.6
Rate2 = 8.33
Rate3 = 4.8
Rate4 = 0.01

In [3]:
Payment1 = {'Date':[u'2017-07-24',u'2017-08-21',u'2017-09-21',u'2017-10-21',u'2017-11-21',u'2017-12-21',u'2018-01-21',u'2018-01-24'],
           'Rate0':[0,1540,1705,1650,1705,1650,1705,165]}
Payment2 = pd.DataFrame(Payment1)

In [4]:
Payment2['Date2'] = Payment2['Date'].shift(1)
Payment2.loc[0:1,'Date2'] = u'2017-07-24'
Payment2['Date1'] = pd.to_datetime(Payment2['Date']).astype(np.object)
Payment2['Date2'] = pd.to_datetime(Payment2['Date2']).astype(np.object)
Payment2['Day'] = (mdates.date2num(Payment2['Date1'])-mdates.date2num(Payment2['Date2'])).astype(np.int)
Payment2['Rate1'] = Ningbo*Rate1/100/360*Payment2['Day']
Payment2['Rate2'] = Ningbo*Rate2/100/360*Payment2['Day']
Payment2['Rate3'] = Baodan*Rate3/100/360*Payment2['Day']+(Ningbo-Baodan)*Rate1/100/360*Payment2['Day']
Payment2['Rate4'] = Cash*Rate4/100/360*Payment2['Day']+(Ningbo-Cash)*Rate1/100/360*Payment2['Day']

In [5]:
Payment = Payment2.loc[1:7,['Date','Day','Rate1','Rate2','Rate3','Rate4']]
Payment.round(3)

         Date  Day   Rate1     Rate2     Rate3     Rate4
1  2017-08-21   28  1540.0  1943.667  1491.423  1283.722
2  2017-09-21   31  1705.0  2151.917  1651.218  1421.264
3  2017-10-21   30  1650.0  2082.500  1597.953  1375.417
4  2017-11-21   31  1705.0  2151.917  1651.218  1421.264
5  2017-12-21   30  1650.0  2082.500  1597.953  1375.417
6  2018-01-21   31  1705.0  2151.917  1651.218  1421.264
7  2018-01-24    3   165.0   208.250   159.795   137.542